In [1]:
import pandas as pd
from pandas.io import gbq

Authorisation code: `4/1AX4XfWiCZpr0PBpQNsrSamSRPWPpwQA-VWKQiquMt8ntnzs8gSr3xJHXEuk`

In [2]:
df_iris = pd.read_csv("https://gist.githubusercontent.com/netj/8836201/raw/6f9306ad21398ea43cba4f7d537619d0e07d5ae3/iris.csv")

In [4]:
df_iris.to_csv('iris_dataset.csv')

In [2]:
query = 'SELECT *  FROM `pandas-io.iris.iris` LIMIT 1000'

In [3]:
df_iris = gbq.read_gbq(query, project_id='pandas-io')

In [4]:
df_iris

,int64_field_0,sepal_length,sepal_width,petal_length,petal_width,variety
0,98,5.1,2.5,3.0,1.1,Versicolor
1,60,5.0,2.0,3.5,1.0,Versicolor
2,79,5.7,2.6,3.5,1.0,Versicolor
3,62,6.0,2.2,4.0,1.0,Versicolor
4,92,5.8,2.6,4.0,1.2,Versicolor
...,...,...,...,...,...,...
145,2,4.7,3.2,1.3,0.2,Setosa
146,36,5.5,3.5,1.3,0.2,Setosa
147,38,4.4,3.0,1.3,0.2,Setosa
148,42,4.4,3.2,1.3,0.2,Setosa
149,16,5.4,3.9,1.3,0.4,Setosa

In [6]:
df_countries = pd.DataFrame({'country_name':['New Zealand', 'China', 'USA'],
                             'location':['Australisa', 'Asia', 'North America']})

df_countries

  country_name       location
0  New Zealand     Australisa
1        China           Asia
2          USA  North America

In [9]:
df_countries.to_gbq(destination_table='iris.countries', project_id='pandas-io', if_exists='replace')

100%|███████████████████████████████████████████| 1/1 [00:00<00:00, 5949.37it/s]